Tekla.Structures.ModelInternal.PrintingController.PrintReportToPdfArgs
Print report to PDF arguments.

Tekla.Structures.ModelInternal.PrintingController.PrintReportToPdfArgs.ReportPath
Gets or sets the report path.

Tekla.Structures.ModelInternal.PrintingController.PrintReportToPdfArgs.Width
Gets or sets the width.

Tekla.Structures.ModelInternal.PrintingController.PrintReportToPdfArgs.SheetHeight
Gets or sets the sheet height.

Tekla.Structures.ModelInternal.PrintingController.PrintReportToPdfArgs.TotalHeight
Gets or sets the total height.

Tekla.Structures.ModelInternal.PrintingController.PrintReportToPdfArgs.LeftMargin
Gets or sets the left margin.

Tekla.Structures.ModelInternal.PrintingController.PrintReportToPdfArgs.RightMargin
Gets or sets the right margin.

Tekla.Structures.ModelInternal.PrintingController.PrintReportToPdfArgs.TopMargin
Gets or sets the top margin.

Tekla.Structures.ModelInternal.PrintingController.PrintReportToPdfArgs.BottomMargin
Gets or sets the bottom margin.

Tekla.Structures.ModelInternal.PrintingController.PrintReportToPdfArgs.DisplayReport
Gets or sets a value indicating whether to display the report.